xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_FS.cpp
#ifdef ESP32_PLATFORM

#include <ESP32Driver/Esp32Driver.h>

#include <SPIFFS.h>

#include "BuildinStdlib.h"
#include "GC.h"
#include "VM.h"

#pragma region spiffs_support

#include <unordered_map>
#include <vector>
#include <string>
#include <cstring>

// 存储文件句柄
static std::unordered_map<uint32_t, File> fileHandles;
static uint32_t fileHandleIdSeed = 1;

// 文件操作枚举
enum FileMode {
  NEXUS_FILE_READ = 0,
  NEXUS_FILE_WRITE = 1,
  NEXUS_FILE_APPEND = 2
};

std::unordered_map<std::string, VariableValue> FileObjectFuncTemplate;

void File_ObjectFuncTemplateInit() {
  // 关闭文件
  FileObjectFuncTemplate["close"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t fileId = (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        
        auto it = fileHandles.find(fileId);
        if (it != fileHandles.end()) {
          it->second.close();
          fileHandles.erase(it);
          thisValue->implement.objectImpl.erase("finalize");
          return CreateBooleanVariable(true);
        }
        
        return CreateBooleanVariable(false);
      });
  
  // 读取文件
  FileObjectFuncTemplate["read"] = VM::CreateSystemFunc(
      3,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::OBJECT ||
            args[1].getContentType() != ValueType::NUM ||
            args[2].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("Invalid argument type: expected (buffer, offset, length)");
          return VariableValue();
        }
        
        uint32_t fileId = (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto it = fileHandles.find(fileId);
        if (it == fileHandles.end()) {
          currentWorker->ThrowError("File not open or already closed");
          return VariableValue();
        }
        
        auto& file = it->second;
        
        // 获取缓冲区
        auto& obj = args[0].content.ref->implement.objectImpl;
        if (obj.find("bufid") == obj.end()) {
          currentWorker->ThrowError("Invalid buffer object");
          return VariableValue();
        }
        
        uint32_t bufid = (uint32_t)obj["bufid"].content.number;
        auto buf_info = GetByteBufferInfo(bufid);
        if (!buf_info.data) {
          currentWorker->ThrowError("Invalid buffer");
          return VariableValue();
        }
        
        size_t offset = (size_t)args[1].content.number;
        size_t length = (size_t)args[2].content.number;
        
        if (offset + length > buf_info.length) {
          currentWorker->ThrowError("Buffer overflow");
          return VariableValue();
        }
        
        // 读取数据
        size_t bytesRead = file.read(buf_info.data + offset, length);
        
        return CreateNumberVariable((double)bytesRead);
      });
  
  // 写入文件
  FileObjectFuncTemplate["write"] = VM::CreateSystemFunc(
      3,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::NUM ||
            args[1].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("Invalid argument type: expected (offset, length, data)");
          return VariableValue();
        }
        
        uint32_t fileId = (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto it = fileHandles.find(fileId);
        if (it == fileHandles.end()) {
          currentWorker->ThrowError("File not open or already closed");
          return VariableValue();
        }
        
        auto& file = it->second;
        size_t offset = (size_t)args[0].content.number;
        size_t length = (size_t)args[1].content.number;
        
        
        size_t bytesWritten = 0;
        
        if (args[2].getContentType() == ValueType::NUM) {
          // 写入单个字节
          uint8_t data = (uint8_t)args[2].content.number;
          bytesWritten = file.write(&data, 1);
        } else if (args[2].getContentType() == ValueType::OBJECT) {
          // 写入缓冲区
          auto& obj = args[2].content.ref->implement.objectImpl;
          if (obj.find("bufid") != obj.end()) {
            uint32_t bufid = obj["bufid"].content.number;
            auto buf_info = GetByteBufferInfo(bufid);
            if (!buf_info.data) {
              currentWorker->ThrowError("Invalid buffer");
              return VariableValue();
            }

            if(offset + length > buf_info.length){
              currentWorker->ThrowError("Buffer overflow");
              return VariableValue();
            }
            
            bytesWritten = file.write(buf_info.data + offset, length);
          } else {
            currentWorker->ThrowError("Invalid buffer object");
            return VariableValue();
          }
        }else if(args[2].getContentType() == ValueType::STRING){
          std::string& strData = args[2].content.ref->implement.stringImpl;
          file.write((uint8_t*)&strData[0],strData.size());
          bytesWritten = strData.size();
        }
        else{
          currentWorker->ThrowError("not support content type");
          return VariableValue();
        }
        
        return CreateNumberVariable((double)bytesWritten);
      });
  
  // 获取文件大小
  FileObjectFuncTemplate["size"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t fileId = (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto it = fileHandles.find(fileId);
        if (it == fileHandles.end()) {
          currentWorker->ThrowError("File not open or already closed");
          return VariableValue();
        }
        
        return CreateNumberVariable((double)it->second.size());
      });
  
