xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_FS.cpp
  // 获取当前位置
  FileObjectFuncTemplate["position"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t fileId = (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto it = fileHandles.find(fileId);
        if (it == fileHandles.end()) {
          currentWorker->ThrowError("File not open or already closed");
          return VariableValue();
        }
        
        return CreateNumberVariable((double)it->second.position());
      });
  
  // 移动文件指针
  FileObjectFuncTemplate["seek"] = VM::CreateSystemFunc(
      2,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::NUM ||
            args[1].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("Invalid argument type: expected (offset, whence)");
          return VariableValue();
        }
        
        uint32_t fileId = (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto it = fileHandles.find(fileId);
        if (it == fileHandles.end()) {
          currentWorker->ThrowError("File not open or already closed");
          return VariableValue();
        }
        
        long offset = (long)args[0].content.number;
        int whence = (int)args[1].content.number;
        
        SeekMode mode;
        switch (whence) {
          case 0: mode = SeekSet; break;  // 文件开头
          case 1: mode = SeekCur; break;  // 当前位置
          case 2: mode = SeekEnd; break;  // 文件末尾
          default:
            currentWorker->ThrowError("Invalid seek mode");
            return VariableValue();
        }
        
        bool result = it->second.seek(offset, mode);
        return CreateBooleanVariable(result);
      });
  
  // 刷新文件
  FileObjectFuncTemplate["flush"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t fileId = (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto it = fileHandles.find(fileId);
        if (it == fileHandles.end()) {
          currentWorker->ThrowError("File not open or already closed");
          return VariableValue();
        }
        
        it->second.flush();
        return CreateBooleanVariable(true);
      });
  
  // 析构函数
  FileObjectFuncTemplate["finalize"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t fileId = (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        
        auto it = fileHandles.find(fileId);
        if (it != fileHandles.end()) {
          it->second.close();
          fileHandles.erase(it);
        }
        
        return CreateBooleanVariable(true);
      });
}

void ESP32_FSAPI_Init(VM* VMInstance) {
  // 初始化文件对象模板
  File_ObjectFuncTemplateInit();
  
  // 创建文件系统类
  VMObject* fsClass = VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);
  
  // 格式化文件系统
  fsClass->implement.objectImpl["format"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (!SPIFFS.begin(true)) {
          return CreateBooleanVariable(false);
        }
        
        bool result = SPIFFS.format();
        SPIFFS.end();
        return CreateBooleanVariable(result);
      });
  
  // 挂载文件系统
  fsClass->implement.objectImpl["mount"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (!SPIFFS.begin(true)) {
          return CreateBooleanVariable(false);
        }
        return CreateBooleanVariable(true);
      });
  
  // 卸载文件系统
  fsClass->implement.objectImpl["unmount"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        SPIFFS.end();
        return CreateBooleanVariable(true);
      });
  
  // 打开文件
  fsClass->implement.objectImpl["open"] = VM::CreateSystemFunc(
      2,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING ||
            args[1].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("Invalid argument type: expected (path, mode)");
          return VariableValue();
        }
        
        std::string path = args[0].content.ref->implement.stringImpl;
        int mode = (int)args[1].content.number;
        
        const char* modeStr = "";
        switch (mode) {
          case NEXUS_FILE_READ: modeStr = "r"; break;
          case NEXUS_FILE_WRITE: modeStr = "w"; break;
          case NEXUS_FILE_APPEND: modeStr = "a"; break;
          default:
            currentWorker->ThrowError("Invalid file mode");
            return VariableValue();
        }
        
        File file = SPIFFS.open(path.c_str(), modeStr);
        if (!file) {
          return CreateBooleanVariable(false);
        }
        
        // 创建文件对象
        VMObject* fileObject = currentWorker->VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);
        fileObject->implement.objectImpl = FileObjectFuncTemplate;
        
        // 分配文件ID
        uint32_t fileId = fileHandleIdSeed++;
        fileObject->implement.objectImpl["_id"] = CreateNumberVariable((double)fileId);
        fileObject->implement.objectImpl["path"] = args[0];
        fileObject->implement.objectImpl["mode"] = CreateNumberVariable((double)mode);
        
        // 存储文件句柄
        fileHandles[fileId] = file;
        
