xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_FS.cpp
        return CreateReferenceVariable(fileObject);
      });
  
  // 删除文件
  fsClass->implement.objectImpl["remove"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("Invalid argument type: expected (path)");
          return VariableValue();
        }
        
        std::string path = args[0].content.ref->implement.stringImpl;
        bool result = SPIFFS.remove(path.c_str());
        return CreateBooleanVariable(result);
      });
  
  // 重命名文件
  fsClass->implement.objectImpl["rename"] = VM::CreateSystemFunc(
      2,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING ||
            args[1].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("Invalid argument type: expected (oldPath, newPath)");
          return VariableValue();
        }
        
        std::string oldPath = args[0].content.ref->implement.stringImpl;
        std::string newPath = args[1].content.ref->implement.stringImpl;
        
        bool result = SPIFFS.rename(oldPath.c_str(), newPath.c_str());
        return CreateBooleanVariable(result);
      });
  
  // 检查文件是否存在
  fsClass->implement.objectImpl["exists"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("Invalid argument type: expected (path)");
          return VariableValue();
        }
        
        std::string path = args[0].content.ref->implement.stringImpl;
        bool exists = SPIFFS.exists(path.c_str());
        return CreateBooleanVariable(exists);
      });
  
  // 获取文件信息
  fsClass->implement.objectImpl["stat"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("Invalid argument type: expected (path)");
          return VariableValue();
        }
        
        std::string path = args[0].content.ref->implement.stringImpl;
        if (!SPIFFS.exists(path.c_str())) {
          return VariableValue();  // 返回null
        }
        
        File file = SPIFFS.open(path.c_str(), "r");
        if (!file) {
          return VariableValue();  // 返回null
        }
        
        VMObject* infoObj = currentWorker->VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);
        infoObj->implement.objectImpl["name"] = args[0];
        infoObj->implement.objectImpl["size"] = CreateNumberVariable((double)file.size());
        infoObj->implement.objectImpl["isDirectory"] = CreateBooleanVariable(false);
        infoObj->implement.objectImpl["isFile"] = CreateBooleanVariable(true);
        
        file.close();
        return CreateReferenceVariable(infoObj);
      });
  
  // 列出目录
  fsClass->implement.objectImpl["listDir"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("Invalid argument type: expected (path)");
          return VariableValue();
        }
        
        std::string path = args[0].content.ref->implement.stringImpl;
        File root = SPIFFS.open(path.c_str());
        
        if (!root || !root.isDirectory()) {
          if (root) root.close();
          currentWorker->ThrowError("fail to list directory");
          return VariableValue();
        }
        
        VMObject* arrayObj = currentWorker->VMInstance->currentGC->GC_NewObject(ValueType::ARRAY);
        
        File file = root.openNextFile();
        while (file) {
        //给每一个文件创建一个info对象，只包含属性
          VMObject* infoObj = currentWorker->VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);
          infoObj->implement.objectImpl["name"] = CreateReferenceVariable(currentWorker->VMInstance->currentGC->GC_NewStringObject(file.name()));
          infoObj->implement.objectImpl["size"] = CreateNumberVariable((double)file.size());
          infoObj->implement.objectImpl["isDirectory"] = CreateBooleanVariable(file.isDirectory());
          infoObj->implement.objectImpl["isFile"] = CreateBooleanVariable(!file.isDirectory());
          
          arrayObj->implement.arrayImpl.push_back(CreateReferenceVariable(infoObj));
          file = root.openNextFile();
        }
        
        root.close();
        return CreateReferenceVariable(arrayObj);
      });
      // 创建目录（SPIFFS的文件夹是假的，所以为了兼容性模拟一下）
  fsClass->implement.objectImpl["mkdir"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("Invalid argument type: expected (path)");
          return VariableValue();
        }
        
        std::string path = args[0].content.ref->implement.stringImpl;
        
        // SPIFFS的mkdir实际上只是标记，不创建实际的目录结构
        // 但可以检查路径格式是否正确
        if (path.empty() || path == "/") {
          return CreateBooleanVariable(true); // 根目录总是存在
        }
        
        // 检查路径中是否包含不支持的字符
        if (path.find("\\") != std::string::npos ||
            path.find(":") != std::string::npos ||
            path.find("*") != std::string::npos ||
            path.find("?") != std::string::npos ||
            path.find("\"") != std::string::npos ||
            path.find("<") != std::string::npos ||
            path.find(">") != std::string::npos ||
            path.find("|") != std::string::npos) {
          currentWorker->ThrowError("Invalid characters in path");
          return VariableValue();
        }
        
        // SPIFFS中mkdir总是成功，因为实际目录结构是虚拟的
        return CreateBooleanVariable(true);
      });
  
  // 删除目录（SPIFFS中，删除目录需要先删除目录下的所有文件）
  fsClass->implement.objectImpl["rmdir"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("Invalid argument type: expected (path)");
          return VariableValue();
        }
        
        std::string path = args[0].content.ref->implement.stringImpl;
        
