xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_FS.cpp
        // 确保路径以/结尾用于目录匹配
        std::string dirPath = path;
        if (!dirPath.empty() && dirPath.back() != '/') {
          dirPath += "/";
        }
        
        // 列出目录下的所有文件
        File root = SPIFFS.open(path.c_str());
        if (!root || !root.isDirectory()) {
          if (root) root.close();
          // 如果不是目录，尝试作为文件删除
          bool result = SPIFFS.remove(path.c_str());
          return CreateBooleanVariable(result);
        }
        
        bool allDeleted = true;
        
        // 递归删除目录下的所有文件
        File file = root.openNextFile();
        while (file) {
          std::string fileName = file.name();
          
          if (file.isDirectory()) {
            // 递归删除子目录
            VariableValue dirArg = CreateReferenceVariable(
                currentWorker->VMInstance->currentGC->GC_NewStringObject(fileName));
            std::vector<VariableValue> rmdirArgs = {dirArg};
            
            //调用自身的rmdir函数递归删除
            auto rmdirFunc = thisValue->implement.objectImpl["rmdir"];
            VariableValue result = rmdirFunc.content.function->funcImpl.system_func(
                rmdirArgs, thisValue, currentWorker);
                
            if (result.getContentType() == ValueType::BOOL && 
                result.content.boolean == false) {
              allDeleted = false;
            }
          } else {
            // 删除文件
            bool deleted = SPIFFS.remove(fileName.c_str());
            if (!deleted) {
              allDeleted = false;
            }
          }
          
          file = root.openNextFile();
        }
        
        root.close();
        return CreateBooleanVariable(allDeleted);
      });
  
  // 删除目录及其所有内容（递归删除）
  fsClass->implement.objectImpl["removeDir"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        // 直接调用rmdir，因为SPIFFS中rmdir就是递归删除
        return thisValue->implement.objectImpl["rmdir"].content.function->funcImpl.system_func(
            args, thisValue, currentWorker);
      });
  
  // 检查是否为目录
  fsClass->implement.objectImpl["isDirectory"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("Invalid argument type: expected (path)");
          return VariableValue();
        }
        
        std::string path = args[0].content.ref->implement.stringImpl;
        
        if (path.empty() || path == "/") {
          return CreateBooleanVariable(true); // 根目录
        }
        
        // 检查路径是否存在文件
        if (SPIFFS.exists(path.c_str())) {
          // 打开路径检查是否是目录
          File file = SPIFFS.open(path.c_str());
          if (file) {
            bool isDir = file.isDirectory();
            file.close();
            return CreateBooleanVariable(isDir);
          }
        }
        
        // 检查是否有以此路径开头的文件（在SPIFFS中表示这是一个目录）
        File root = SPIFFS.open("/");
        if (!root || !root.isDirectory()) {
          if (root) root.close();
          return CreateBooleanVariable(false);
        }
        
        std::string dirPath = path;
        if (!dirPath.empty() && dirPath.back() != '/') {
          dirPath += "/";
        }
        
        bool hasFilesInDir = false;
        File file = root.openNextFile();
        while (file) {
          std::string fileName = file.name();
          // 检查文件路径是否以目录路径开头
          if (fileName.find(dirPath) == 0) {
            hasFilesInDir = true;
            break;
          }
          file = root.openNextFile();
        }
        
        root.close();
        return CreateBooleanVariable(hasFilesInDir);
      });
  
  // 获取总空间
  fsClass->implement.objectImpl["totalBytes"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        return CreateNumberVariable((double)SPIFFS.totalBytes());
      });
  
  // 获取可用空间
  fsClass->implement.objectImpl["usedBytes"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        return CreateNumberVariable((double)SPIFFS.usedBytes());
      });
  
  // 文件模式常量
  fsClass->implement.objectImpl["FILE_READ"] = CreateNumberVariable((double)NEXUS_FILE_READ);
  fsClass->implement.objectImpl["FILE_WRITE"] = CreateNumberVariable((double)NEXUS_FILE_WRITE);
  fsClass->implement.objectImpl["FILE_APPEND"] = CreateNumberVariable((double)NEXUS_FILE_APPEND);
  
  // 注册到全局变量
  std::string fsClassName = "FS";
  auto fsClassRef = CreateReferenceVariable(fsClass);
  VMInstance->storeGlobalSymbol(fsClassName, fsClassRef);
}

#pragma endregion

#endif

